In [19]:
#dataframes are combination of rows and columns
import pandas as pd
import numpy as np

df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1', 'Row2', 'Row3', 'Row4','Row5'], columns = ['col1','col2','col3','col4'])
df.head()          #prints the top 5 entries

      col1  col2  col3  col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [20]:
df.to_csv('test.csv')       #coverting the data to csv file and savinf it locally

In [21]:
df.loc['Row1']              #showing one row or one column

col1    0
col2    1
col3    2
col4    3
Name: Row1, dtype: int32

In [22]:
df.iloc[0:3, 0:2]             #showing more than one rows or columns

      col1  col2
Row1     0     1
Row2     4     5
Row3     8     9

In [24]:
df.isnull().sum()            #no. of zero elements in each row

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [27]:
df1 = pd.read_csv('industry.csv')       #to read a csv file
df1.info()                              # gives details like no. of columns rows etc

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Industry  43 non-null     object
dtypes: object(1)
memory usage: 476.0+ bytes

In [28]:
df1.describe()

                  Industry
count                   43
unique                  43
top     Accounting/Finance
freq                     1

In [33]:
from io import StringIO

data = ('col1,col2,col3\n'
       'x,y,1\n'
        'a,b,2\n'
        'c,d,3\n'
       )
df2= pd.read_csv(StringIO(data))  #to covert string data type to csv
df2.head()

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [35]:
df2= pd.read_csv(StringIO(data), usecols=['col1','col3'])
df2.head()

  col1  col3
0    x     1
1    a     2
2    c     3

In [37]:
df2= pd.read_csv(StringIO(data), index_col=0, header=0)
df2.head()

     col2  col3
col1
x       y     1
a       b     2
c       d     3